# 10 minutes to pandas

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the

In [1]:
#import importent libraries 
import numpy as np
import pandas as pd

### Object creation

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [3]:
x = pd.Series([1,2,np.nan,2.3])
x

0    1.0
1    2.0
2    NaN
3    2.3
dtype: float64

In [7]:
dates = pd.date_range('20200101', periods=6)

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

### Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [9]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),'F':'cool'})
df2

     A          B    C  D      E     F
0  1.0 2013-01-02  1.0  3   test  cool
1  1.0 2013-01-02  1.0  3  train  cool
2  1.0 2013-01-02  1.0  3   test  cool
3  1.0 2013-01-02  1.0  3  train  cool

#### The columns of the resulting DataFrame have different dtypes.

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#### Viewing data

In [13]:
#Here is how to view the top and bottom rows of the frame:
df.head(3)
df.tail(2)

                   A         B         C         D
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

In [14]:
#Display the index
df.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
#Display the columns:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

 **DataFrame.to_numpy()** gives a NumPy representation of the underlying data.
- Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

###### For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesn’t require copying data.

In [17]:
df
df.to_numpy()

array([[ 0.43116137,  2.00116671,  0.51989298,  0.74503213],
       [-0.0276311 , -1.58742128,  1.0978403 , -0.99534937],
       [ 0.57884774, -0.16559705, -0.35937237, -2.45518754],
       [-0.0555321 ,  0.03523545, -0.42103274,  1.10669833],
       [ 0.57509908, -0.08201678,  0.13347521, -1.68294962],
       [-1.48945853,  0.19613718, -1.79224272,  0.18504567]])

###### For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.

In [19]:
df2
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'cool'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'cool'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'cool'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'cool']],
      dtype=object)

### DataFrame.to_numpy() does not include the index or column labels in the output.

###### describe() shows a quick statistic summary of your data:

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.002081  0.066251 -0.136907 -0.516118
std    0.784093  1.146482  0.989894  1.418930
min   -1.489459 -1.587421 -1.792243 -2.455188
25%   -0.048557 -0.144702 -0.405618 -1.511050
50%    0.201765 -0.023391 -0.112949 -0.405152
75%    0.539115  0.155912  0.423289  0.605036
max    0.578848  2.001167  1.097840  1.106698

In [21]:
#Transposing your data:
df.T

   2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
A    0.431161   -0.027631    0.578848   -0.055532    0.575099   -1.489459
B    2.001167   -1.587421   -0.165597    0.035235   -0.082017    0.196137
C    0.519893    1.097840   -0.359372   -0.421033    0.133475   -1.792243
D    0.745032   -0.995349   -2.455188    1.106698   -1.682950    0.185046

In [23]:
#Sorting by an axis:
df.sort_index(axis=1, ascending=False)

                   A         B         C         D
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

In [24]:
#Sorting by values:
df.sort_values('C')

                   A         B         C         D
2020-01-06 -1.489459  0.196137 -1.792243  0.185046
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349

### Selection

While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, **.at, .iat, .loc and .iloc.**

###### Selecting a single column, which yields a Series:

In [27]:
df['A']

2020-01-01    0.431161
2020-01-02   -0.027631
2020-01-03    0.578848
2020-01-04   -0.055532
2020-01-05    0.575099
2020-01-06   -1.489459
Freq: D, Name: A, dtype: float64

###### Selecting via [], which slices the rows.

In [47]:
df[1:3]
df[:2]
#For slicing columns explicitly:
df.iloc[:,:2]

                   A         B
2020-01-01  0.431161  2.001167
2020-01-02 -0.027631 -1.587421
2020-01-03  0.578848 -0.165597
2020-01-04 -0.055532  0.035235
2020-01-05  0.575099 -0.082017
2020-01-06 -1.489459  0.196137

In [50]:
#For getting a value explicitly:
df.iloc[1,2]

1.097840295789385

In [49]:
#For getting fast access to a scalar (equivalent to the prior method):
df.iloc[1,2]

1.097840295789385

#### Selection by label

In [58]:
#For getting a cross section using a label:
df.loc[dates[1]]
#dates

A   -0.027631
B   -1.587421
C    1.097840
D   -0.995349
Name: 2020-01-02 00:00:00, dtype: float64

In [59]:
#Selecting on a multi-axis by label:
df.loc[:, ['A', 'B']]

                   A         B
2020-01-01  0.431161  2.001167
2020-01-02 -0.027631 -1.587421
2020-01-03  0.578848 -0.165597
2020-01-04 -0.055532  0.035235
2020-01-05  0.575099 -0.082017
2020-01-06 -1.489459  0.196137

In [61]:
#Showing label slicing, both endpoints are included:
df.loc['20200102':'20200104', ['A', 'B']]

                   A         B
2020-01-02 -0.027631 -1.587421
2020-01-03  0.578848 -0.165597
2020-01-04 -0.055532  0.035235

In [63]:
#Reduction in the dimensions of the returned object:
df.loc['20200102', ['A', 'B']]

A   -0.027631
B   -1.587421
Name: 2020-01-02 00:00:00, dtype: float64

In [64]:
#For getting a scalar value:
df.loc[dates[0], 'A']

0.43116136953622064

In [65]:
#For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], 'A']

0.43116136953622064

#### Selection by position

In [70]:
#Select via the position of the passed integers:
df.iloc[3]
#df.iloc[1,1]

A   -0.055532
B    0.035235
C   -0.421033
D    1.106698
Name: 2020-01-04 00:00:00, dtype: float64

In [71]:
#By integer slices, acting similar to numpy/python:
df.iloc[3:5, 0:2]

                   A         B
2020-01-04 -0.055532  0.035235
2020-01-05  0.575099 -0.082017

In [72]:
#By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2020-01-02 -0.027631  1.097840
2020-01-03  0.578848 -0.359372
2020-01-05  0.575099  0.133475

In [73]:
#For slicing rows explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188

In [74]:
#For slicing columns explicitly:
df.iloc[:, 1:3]

                   B         C
2020-01-01  2.001167  0.519893
2020-01-02 -1.587421  1.097840
2020-01-03 -0.165597 -0.359372
2020-01-04  0.035235 -0.421033
2020-01-05 -0.082017  0.133475
2020-01-06  0.196137 -1.792243

In [76]:
#For getting a value explicitly:
df.iloc[1, 1]

-1.5874212787267339

In [77]:
#For getting fast access to a scalar (equivalent to the prior method):
df.iat[1, 1]

-1.5874212787267339

#### Boolean indexing

In [78]:
#Using a single column’s values to select data.
df[df['A'] > 0]

                   A         B         C         D
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-05  0.575099 -0.082017  0.133475 -1.682950

In [79]:
#Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-02       NaN       NaN  1.097840       NaN
2020-01-03  0.578848       NaN       NaN       NaN
2020-01-04       NaN  0.035235       NaN  1.106698
2020-01-05  0.575099       NaN  0.133475       NaN
2020-01-06       NaN  0.196137       NaN  0.185046

In [82]:
#Using the isin() method for filtering:
df2 = df.copy()
df2

                   A         B         C         D
2020-01-01  0.431161  2.001167  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

In [84]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2020-01-01  0.431161  2.001167  0.519893  0.745032    one
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349    one
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188    two
2020-01-04 -0.055532  0.035235 -0.421033  1.106698  three
2020-01-05  0.575099 -0.082017  0.133475 -1.682950   four
2020-01-06 -1.489459  0.196137 -1.792243  0.185046  three

In [85]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188   two
2020-01-05  0.575099 -0.082017  0.133475 -1.682950  four

#### Setting

In [87]:
#Setting a new column automatically aligns the data by the indexes.
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20120102', periods=6))
s1

2012-01-02    1
2012-01-03    2
2012-01-04    3
2012-01-05    4
2012-01-06    5
2012-01-07    6
Freq: D, dtype: int64

In [89]:
#Setting values by label:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D
2020-01-01  0.000000  2.001167  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

In [91]:
#Setting values by position:
df.iat[0, 1] = 0
df

                   A         B         C         D
2020-01-01  0.000000  0.000000  0.519893  0.745032
2020-01-02 -0.027631 -1.587421  1.097840 -0.995349
2020-01-03  0.578848 -0.165597 -0.359372 -2.455188
2020-01-04 -0.055532  0.035235 -0.421033  1.106698
2020-01-05  0.575099 -0.082017  0.133475 -1.682950
2020-01-06 -1.489459  0.196137 -1.792243  0.185046

In [95]:
#Setting by assigning with a NumPy array:
df.loc[:, 'D'] = np.array([5] * len(df))
df

6

In [99]:
#A *where* operation with setting.
df2 = df.copy()
df2
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2020-01-01  0.000000  0.000000 -0.519893 -5
2020-01-02 -0.027631 -1.587421 -1.097840 -5
2020-01-03 -0.578848 -0.165597 -0.359372 -5
2020-01-04 -0.055532 -0.035235 -0.421033 -5
2020-01-05 -0.575099 -0.082017 -0.133475 -5
2020-01-06 -1.489459 -0.196137 -1.792243 -5

#### Missing data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

#### Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [102]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2020-01-01  0.000000  0.000000  0.519893  5  1.0
2020-01-02 -0.027631 -1.587421  1.097840  5  1.0
2020-01-03  0.578848 -0.165597 -0.359372  5  NaN
2020-01-04 -0.055532  0.035235 -0.421033  5  NaN

In [105]:
#To drop any rows that have missing data.

df1.dropna(how='any')

                   A         B         C  D    E
2020-01-01  0.000000  0.000000  0.519893  5  1.0
2020-01-02 -0.027631 -1.587421  1.097840  5  1.0

In [106]:
#Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    E
2020-01-01  0.000000  0.000000  0.519893  5  1.0
2020-01-02 -0.027631 -1.587421  1.097840  5  1.0
2020-01-03  0.578848 -0.165597 -0.359372  5  5.0
2020-01-04 -0.055532  0.035235 -0.421033  5  5.0

In [109]:
#To get the boolean mask where values are nan.
#df1
#pd.isna(df1)

                A      B      C      D      E
2020-01-01  False  False  False  False  False
2020-01-02  False  False  False  False  False
2020-01-03  False  False  False  False   True
2020-01-04  False  False  False  False   True

### Operations

##### Stats

Operations in general exclude missing data.

Performing a descriptive statistic:

In [110]:
df.mean()

A   -0.069779
B   -0.267277
C   -0.136907
D    5.000000
dtype: float64

In [111]:
#Same operation on the other axis:
df.mean(1)

2020-01-01    1.379973
2020-01-02    1.120697
2020-01-03    1.263470
2020-01-04    1.139668
2020-01-05    1.406639
2020-01-06    0.478609
Freq: D, dtype: float64

#### Apply

Applying functions to the data:

In [112]:
df

                   A         B         C  D
2020-01-01  0.000000  0.000000  0.519893  5
2020-01-02 -0.027631 -1.587421  1.097840  5
2020-01-03  0.578848 -0.165597 -0.359372  5
2020-01-04 -0.055532  0.035235 -0.421033  5
2020-01-05  0.575099 -0.082017  0.133475  5
2020-01-06 -1.489459  0.196137 -1.792243  5

In [113]:
df.apply(np.cumsum)

                   A         B         C   D
2020-01-01  0.000000  0.000000  0.519893   5
2020-01-02 -0.027631 -1.587421  1.617733  10
2020-01-03  0.551217 -1.753018  1.258361  15
2020-01-04  0.495685 -1.717783  0.837328  20
2020-01-05  1.070784 -1.799800  0.970803  25
2020-01-06 -0.418675 -1.603662 -0.821439  30

In [121]:
df.apply(lambda x: x.max()-x.min())

A    2.068306
B    1.783558
C    2.890083
D    0.000000
dtype: float64

In [116]:
df['A'].max()

0.5788477367635823

In [117]:
df['A'].min()

-1.4894585297123681

In [119]:
print(df)

                   A         B         C  D
2020-01-01  0.000000  0.000000  0.519893  5
2020-01-02 -0.027631 -1.587421  1.097840  5
2020-01-03  0.578848 -0.165597 -0.359372  5
2020-01-04 -0.055532  0.035235 -0.421033  5
2020-01-05  0.575099 -0.082017  0.133475  5
2020-01-06 -1.489459  0.196137 -1.792243  5

##### Histogramming

In [123]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    3
2    0
3    0
4    0
5    2
6    0
7    1
8    6
9    0
dtype: int32

In [124]:
s.value_counts()

0    5
6    1
4    1
3    1
2    1
1    1
dtype: int64

##### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them).

In [125]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [126]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

#### Merge

Concat

pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

In [128]:
#Concatenating pandas objects together with concat():
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.625907 -0.119808 -0.683027 -1.798871
1  0.114398 -0.951403 -1.390297 -2.369392
2 -1.051137 -1.630361 -1.659215 -0.402753
3 -1.977601 -0.016847  0.354182  0.237956
4 -0.070694 -1.745836  0.443589 -1.290524
5  0.280362 -1.011296  0.300041  0.784607
6 -0.791570  0.777180  0.599926  0.730351
7 -0.387622 -0.562567 -0.738346 -0.527004
8 -0.341603  0.096344  1.609196  0.381226
9 -0.037942  1.530087  0.640290  1.402108

In [136]:
#pieces = [df[:3],df[3:7]]
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.625907 -0.119808 -0.683027 -1.798871
 1  0.114398 -0.951403 -1.390297 -2.369392
 2 -1.051137 -1.630361 -1.659215 -0.402753,
           0         1         2         3
 3 -1.977601 -0.016847  0.354182  0.237956
 4 -0.070694 -1.745836  0.443589 -1.290524
 5  0.280362 -1.011296  0.300041  0.784607
 6 -0.791570  0.777180  0.599926  0.730351,
           0         1         2         3
 7 -0.387622 -0.562567 -0.738346 -0.527004
 8 -0.341603  0.096344  1.609196  0.381226
 9 -0.037942  1.530087  0.640290  1.402108]

In [135]:
pd.concat(pieces)

          0         1         2         3
0  1.625907 -0.119808 -0.683027 -1.798871
1  0.114398 -0.951403 -1.390297 -2.369392
2 -1.051137 -1.630361 -1.659215 -0.402753
3 -1.977601 -0.016847  0.354182  0.237956
4 -0.070694 -1.745836  0.443589 -1.290524
5  0.280362 -1.011296  0.300041  0.784607
6 -0.791570  0.777180  0.599926  0.730351

Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

### Join

#SQL style merges. See the Database style joining section.

In [140]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left
right

   key  rval
0  foo     4
1  foo     5

In [141]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another example that can be given is:

In [144]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left
right

   key  lval
0  foo     1
1  bar     2

In [145]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

#### Grouping

By “group by” we are referring to a process involving one or more of the following steps:

        Splitting the data into groups based on some criteria

        Applying a function to each group independently

        Combining the results into a data structure

In [146]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})

In [147]:
df

     A      B         C         D
0  foo    one -0.670743 -1.235659
1  bar    one  1.257662 -0.880742
2  foo    two -0.598093 -0.296738
3  bar  three -0.566187  0.552543
4  foo    two -2.393835 -0.815849
5  bar    two  0.243661  1.371058
6  foo    one -0.230677 -1.465330
7  foo  three -0.572382 -0.888768

Grouping and then applying the **sum()** function to the resulting groups.

In [156]:
df.groupby('A').sum()

            C         D
A
bar  0.935135  1.042860
foo -4.465730 -4.702343

Grouping by multiple columns forms a hierarchical index, and again we can apply the sum() function.

In [157]:
 df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.257662 -0.880742
    three -0.566187  0.552543
    two    0.243661  1.371058
foo one   -0.901420 -2.700989
    three -0.572382 -0.888768
    two   -2.991928 -1.112587